INSERT INTO worker (NAME, BIRTHDAY, LEVEL, SALARY) VALUES
                                                       ('John Doe', '1990-05-14', 'Trainee', 800),
                                                       ('Jane Smith', '1987-11-02', 'Junior', 2000),
                                                       ('Michael Johnson', '1995-07-22', 'Middle', 4500),
                                                       ('Emily Davis', '1984-04-19', 'Senior', 6000),
                                                       ('Daniel Wilson', '1992-02-13', 'Trainee', 950),
                                                       ('Sophia Martinez', '1998-09-27', 'Junior', 1800),
                                                       ('Matthew Taylor', '1978-12-05', 'Middle', 5200),
                                                       ('Olivia Thomas', '1986-06-30', 'Senior', 7000),
                                                       ('Liam Brown', '1993-03-11', 'Junior', 3200),
                                                       ('Ava White', '2000-08-15', 'Trainee', 750);

INSERT INTO client (NAME) VALUES
                              ('Company A'),
                              ('Company B'),
                              ('Company C'),
                              ('Company D'),
                              ('Company E');


INSERT INTO project (CLIENT_ID, START_DATE, FINISH_DATE) VALUES
                                                             (1, '2020-01-01', '2020-12-01'),  -- Тривалість 11 місяців
                                                             (2, '2019-03-15', '2020-03-15'),  -- Тривалість 12 місяців
                                                             (3, '2021-06-01', '2021-12-01'),  -- Тривалість 6 місяців
                                                             (4, '2018-09-01', '2019-12-01'),  -- Тривалість 15 місяців
                                                             (5, '2020-11-01', '2021-02-01'),  -- Тривалість 3 місяці
                                                             (1, '2017-01-01', '2018-01-01'),  -- Тривалість 12 місяців
                                                             (2, '2019-06-01', '2021-06-01'),  -- Тривалість 24 місяці
                                                             (3, '2021-01-01', '2021-04-01'),  -- Тривалість 3 місяці
                                                             (4, '2020-05-01', '2021-03-01'),  -- Тривалість 10 місяців
                                                             (5, '2016-05-01', '2016-06-01');  -- Тривалість 1 місяць

INSERT INTO project_worker (PROJECT_ID, WORKER_ID) VALUES
                                                       (1, 1), (1, 2),
                                                       (2, 3), (2, 4), (2, 5),
                                                       (3, 6),
                                                       (4, 7), (4, 8),
                                                       (5, 9), (5, 10),
                                                       (6, 1), (6, 2), (6, 3),
                                                       (7, 4), (7, 5),
                                                       (8, 6), (8, 7), (8, 8),
                                                       (9, 9),
                                                       (10, 10);
